sschiesser/SMS_nRF5_sensors/sms_sensors2/main.c
    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}
/**@brief Function for handling write events to the LED characteristic.
 *
 * @param[in] p_lbs     Instance of LED Button Service to which the write applies.
 * @param[in] led_state Written/desired state of the LED.
 */
//static void led_write_handler(ble_smss_t * p_smss, uint8_t led_state)
//{
//    if (led_state)
//    {
//        bsp_board_led_on(LEDBUTTON_LED_PIN);
//        NRF_LOG_INFO("Received LED ON!\r\n");
//    }
//    else
//    {
//        bsp_board_led_off(LEDBUTTON_LED_PIN);
//        NRF_LOG_INFO("Received LED OFF!\r\n");
//    }
//}
//static void led1_write_handler(ble_smss_t * p_smss, uint8_t led_state)
//{
//	if (led_state)
//	{
//		for(int i=0; i<10;i++)
//		{
//			nrf_gpio_pin_toggle(LEDBUTTON_LED1_PIN_NO);
//			nrf_delay_us(100000);
//		}
//	}
//	else
//	{
//		for(int i=0; i<24;i++)
//		{
//			nrf_gpio_pin_toggle(LEDBUTTON_LED1_PIN_NO);
//			nrf_delay_us(40000);
//		}
//	}
//}









/**@brief Function for starting advertising.
 */
void advertising_start(void)
{
    uint32_t             err_code;
//    ble_gap_adv_params_t adv_params;

	NRF_LOG_INFO("Starting advertising for %d seconds\n\r", APP_ADV_TIMEOUT_IN_SECONDS);

    bsp_board_led_on(ADVERTISING_LED_PIN);
	err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
	APP_ERROR_CHECK(err_code);
	
//    // Start advertising
//    memset(&adv_params, 0, sizeof(adv_params));

//    adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND;
//    adv_params.p_peer_addr = NULL;
//    adv_params.fp          = BLE_GAP_ADV_FP_ANY;
//    adv_params.interval    = APP_ADV_INTERVAL;
//    adv_params.timeout     = APP_ADV_TIMEOUT_IN_SECONDS;

//    err_code = sd_ble_gap_adv_start(&adv_params);
//    APP_ERROR_CHECK(err_code);
//    bsp_board_led_on(ADVERTISING_LED_PIN);
}




/* ====================================================================
 * RUN-TIME FUNCTIONS
 * --------------------------------------------------------------------
 *
 * ==================================================================== */
static void timers_create(void)
{
	uint32_t err_code;
	err_code = app_timer_create(&pressure_poll_int_id,
								APP_TIMER_MODE_REPEATED,
								pressure_poll_int_handler);
	APP_ERROR_CHECK(err_code);

	err_code = app_timer_create(&imu_poll_int_id,
								APP_TIMER_MODE_REPEATED,
								imu_poll_int_handler);
	APP_ERROR_CHECK(err_code);
	
	err_code = app_timer_create(&button_press_timer_id,
								APP_TIMER_MODE_SINGLE_SHOT,
								button_press_timeout_handler);
	APP_ERROR_CHECK(err_code);
}


/**@brief Function for the Power Manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}


void timers_start(void)
{
	NRF_LOG_INFO("Starting poll timers...\n\r");
	app_timer_start(pressure_poll_int_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_PRESSURE_POLL_MS, UNIT_1_00_MS), 0),
					NULL);
	app_timer_start(imu_poll_int_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_IMU_POLL_MS, UNIT_1_00_MS), 0),
					NULL);
//	nrf_drv_timer_enable(&TIMER_DELTA_US);
}

void timers_stop(void)
{
	NRF_LOG_INFO("Stopping poll timers...\n\r");
	app_timer_stop(pressure_poll_int_id);
	app_timer_stop(imu_poll_int_id);
	app_timer_stop(button_press_timer_id);
}

void button_press_timer_start(void)
{
	app_timer_start(button_press_timer_id,
					APP_TIMER_TICKS(MSEC_TO_UNITS(SMS_BUTTON_LONG_PRESS_MS, UNIT_1_00_MS), 0),
					NULL);
}

/* ====================================================================
 * MAIN
 * ==================================================================== */
/**@brief Function for application main entry.
 */
int main(void)
{
    ret_code_t err_code;
    
    // Initialize
    leds_init();
    timers_init();
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
    buttons_init();
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();

	uint8_t fw_msb, fw_lsb;
	fw_msb = ((SMS_VERSION_ID & 0xFF) > 8);
	fw_lsb = (SMS_VERSION_ID & 0x0F);
	NRF_LOG_INFO("===============================\n\r");
	NRF_LOG_INFO("SMS sensors firmware v%d.%d, r%03d\n\r", fw_msb, fw_lsb, SMS_RELEASE_ID);
	NRF_LOG_INFO("===============================\n\n\r");
	
	NRF_LOG_DEBUG("Initializing hardware...\n\r");
	spi_init();
	twi_init();
	
	// Instantiate
	timers_create();
	
	// Initialize & configure peripherals
	pressure_enable();
	imu_enable();
		
	// Start advertising
	advertising_start();

    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
		
		if(ms58_interrupt.new_value)
		{
			nrf_gpio_pin_write(DBG1_PIN, 1);
			
			ms58_interrupt.new_value = false;
			pressure_poll_data();
			
			nrf_gpio_pin_write(DBG1_PIN, 0);
		}
		
		if(bno055_interrupt.new_value) {
			nrf_gpio_pin_write(DBG2_PIN, 1);

			bno055_interrupt.new_value = false;
			imu_poll_data(SMS_IMU_DATAMSK_QUAT);
//			NRF_LOG_INFO("Quat: %d %d %d %d\n\r",
//						(int32_t)(bno055_output.quat[0].val * 1000000),
//						(int32_t)(bno055_output.quat[1].val * 1000000),
//						(int32_t)(bno055_output.quat[2].val * 1000000),
//						(int32_t)(bno055_output.quat[3].val * 1000000));
//			bno055_interrupt.rts = true;
			
			nrf_gpio_pin_write(DBG2_PIN, 0);
		}
		
		if(ms58_interrupt.rts) {
			nrf_gpio_pin_write(DBG1_PIN, 1);
			
			ms58_interrupt.rts = false;
			int32_t * tosend;
			tosend = &ms58_output.pressure;
		    bsp_board_led_on(SENDING_LED_PIN);
			err_code = ble_smss_on_press_value(&m_smss_service, tosend);
			bsp_board_led_off(SENDING_LED_PIN);
			if(	(err_code != 0x3401) &&
				(err_code != 0x0008) &&
				(err_code != 0) )
			{
				APP_ERROR_CHECK(err_code);
			}
			
			nrf_gpio_pin_write(DBG1_PIN, 0);
		}
		if(bno055_interrupt.rts) {
			nrf_gpio_pin_write(DBG2_PIN, 1);
			
			bno055_interrupt.rts = false;
			uint32_t * tosend;
			tosend = (uint32_t*)&bno055_output.quat[0].b;
		    bsp_board_led_on(SENDING_LED_PIN);
			err_code = ble_smss_on_imu_value(&m_smss_service, tosend);
		    bsp_board_led_off(SENDING_LED_PIN);
			if(	(err_code != 0x3401) &&
				(err_code != 0x0008) &&
				(err_code != 0) )
			{
				APP_ERROR_CHECK(err_code);
			}
			
			nrf_gpio_pin_write(DBG2_PIN, 0);
		}
    }
}


/**
 * @}
 */
